'use strict';

/**
 * @description
 * В html есть елемент с классом  'menu', и в нем есть три кнопки с классом 'menu-btn'.
 * Сделайте так, чтобы при нажатии на одну из них меняся контент в блоке с классом'content'
 *
 * @example
 * Например, нажал на первую кнопку в блоке 'content' появилась одна картинка, нажал
 * на вторую, прошлая картинка пропала и появилась новая.
 *
 * @description
 *  - Активная кнопка должна подсвечиватся с помощью css класса .active
 *  - Реализвать с помощью OOP
 * */