/** 
    http://take.ms/QQjO1

    Написать класс для создания формы добавления комментариев, используйте наследование.
    Кнопки должны иметь только одно действие, у каждой кнопки оно может быть разным
    В выпадающих списках могут быть как выпадающие списки так и кнопки
    Должен притустовать метод для добавления новой кнопки, которая сможет выполнять ту функцию которую
    вы ей передате, а также у нее должно быть свое название, тип, и картинка (url)
    
    Рекомендации:
    1) Ипользуйте публичные, приватные и защищенные свойства
    2) Используйте обьекты

    Задание на 2 урока 
*/

function CommentForm() {

}

var commentForm = new CommentForm();
